graph main_graph (
  %jets[FLOAT, num_jetsx6]
  %leptons[FLOAT, num_leptonsx6]
  %met[FLOAT, num_metx3]
  %misc[FLOAT, num_miscx3]
) initializers (
  %transformer.encoder.registers[FLOAT, 1x2x128]
  %transformer.encoder.layers.0.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.encoder.layers.0.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.encoder.layers.0.attn.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.0.attn.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.0.attn.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.0.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.encoder.layers.0.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.encoder.layers.0.ff.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.0.ff.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.0.ff.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.1.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.encoder.layers.1.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.encoder.layers.1.attn.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.1.attn.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.1.attn.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.1.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.encoder.layers.1.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.encoder.layers.1.ff.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.1.ff.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.1.ff.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.2.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.encoder.layers.2.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.encoder.layers.2.attn.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.2.attn.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.2.attn.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.2.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.encoder.layers.2.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.encoder.layers.2.ff.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.2.ff.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.2.ff.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.3.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.encoder.layers.3.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.encoder.layers.3.attn.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.3.attn.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.3.attn.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.3.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.encoder.layers.3.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.encoder.layers.3.ff.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.3.ff.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.3.ff.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.4.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.encoder.layers.4.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.encoder.layers.4.attn.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.4.attn.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.4.attn.ls.gamma[FLOAT, 128]
  %transformer.encoder.layers.4.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.encoder.layers.4.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.encoder.layers.4.ff.norm.weight[FLOAT, 128]
  %transformer.encoder.layers.4.ff.norm.bias[FLOAT, 128]
  %transformer.encoder.layers.4.ff.ls.gamma[FLOAT, 128]
  %transformer.encoder.linear_embed.bias[FLOAT, 128]
  %transformer.pool.global_token[FLOAT, 1x1x128]
  %transformer.pool.layers.0.attn.fn.attn_in_w[FLOAT, 384x128]
  %transformer.pool.layers.0.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.pool.layers.0.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.pool.layers.0.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.pool.layers.0.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.pool.layers.1.attn.fn.attn_in_w[FLOAT, 384x128]
  %transformer.pool.layers.1.attn.fn.attn_in_b[FLOAT, 384]
  %transformer.pool.layers.1.attn.fn.attn_out.bias[FLOAT, 128]
  %transformer.pool.layers.1.ff.fn.lin1.bias[FLOAT, 512]
  %transformer.pool.layers.1.ff.fn.lin2.bias[FLOAT, 128]
  %transformer.pool.linear_embed.bias[FLOAT, 128]
  %transformer.pool.final_norm.weight[FLOAT, 128]
  %transformer.pool.final_norm.bias[FLOAT, 128]
  %transformer.pool.linear_out.weight[FLOAT, 128x128]
  %transformer.pool.linear_out.bias[FLOAT, 128]
  %jets_norm.means[FLOAT, 1x6]
  %jets_mlp.input_block.layers.0.bias[FLOAT, 256]
  %jets_mlp.output_block.layers.0.bias[FLOAT, 128]
  %leptons_norm.means[FLOAT, 1x6]
  %leptons_mlp.input_block.layers.0.bias[FLOAT, 256]
  %leptons_mlp.output_block.layers.0.bias[FLOAT, 128]
  %met_norm.means[FLOAT, 1x3]
  %met_mlp.input_block.layers.0.bias[FLOAT, 256]
  %met_mlp.output_block.layers.0.bias[FLOAT, 128]
  %misc_norm.means[FLOAT, 1x3]
  %misc_mlp.input_block.layers.0.bias[FLOAT, 256]
  %misc_mlp.output_block.layers.0.bias[FLOAT, 128]
  %target_norm.means[FLOAT, 1x6]
  %flow.q0.loc[FLOAT, 1x6]
  %flow.flows.0.prqct.identity_features[INT64, 3]
  %flow.flows.0.prqct.transform_features[INT64, 3]
  %flow.flows.0.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.0.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.0.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.0.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.0.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.0.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.1.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.1.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.1.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.1.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.1.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.1.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.2.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.2.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.2.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.2.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.2.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.2.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.3.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.3.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.3.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.3.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.3.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.3.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.4.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.4.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.4.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.4.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.4.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.4.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.5.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.5.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.5.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.5.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.5.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.5.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.6.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.6.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.6.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.6.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.6.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.6.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.7.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.7.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.7.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.7.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.7.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.7.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.8.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.8.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.8.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.8.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.8.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.8.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %flow.flows.9.prqct.transform_net.input_block.layers.0.weight[FLOAT, 64x3]
  %flow.flows.9.prqct.transform_net.input_block.layers.0.bias[FLOAT, 64]
  %flow.flows.9.prqct.transform_net.hidden_blocks.0.layers.0.weight[FLOAT, 64x192]
  %flow.flows.9.prqct.transform_net.hidden_blocks.0.layers.0.bias[FLOAT, 64]
  %flow.flows.9.prqct.transform_net.output_block.layers.0.weight[FLOAT, 87x192]
  %flow.flows.9.prqct.transform_net.output_block.layers.0.bias[FLOAT, 87]
  %onnx::Div_17258[FLOAT, 1x6]
  %onnx::MatMul_17259[FLOAT, 6x256]
  %onnx::MatMul_17260[FLOAT, 256x128]
  %onnx::Div_17262[FLOAT, 1x6]
  %onnx::MatMul_17263[FLOAT, 6x256]
  %onnx::MatMul_17264[FLOAT, 256x128]
  %onnx::Div_17266[FLOAT, 1x3]
  %onnx::MatMul_17267[FLOAT, 3x256]
  %onnx::MatMul_17268[FLOAT, 256x128]
  %onnx::Div_17270[FLOAT, 1x3]
  %onnx::MatMul_17271[FLOAT, 3x256]
  %onnx::MatMul_17272[FLOAT, 256x128]
  %onnx::MatMul_17273[FLOAT, 128x128]
  %onnx::MatMul_17275[FLOAT, 128x384]
  %onnx::MatMul_17287[FLOAT, 128x128]
  %onnx::MatMul_17288[FLOAT, 128x512]
  %onnx::MatMul_17289[FLOAT, 256x128]
  %onnx::MatMul_17290[FLOAT, 128x384]
  %onnx::MatMul_17302[FLOAT, 128x128]
  %onnx::MatMul_17303[FLOAT, 128x512]
  %onnx::MatMul_17304[FLOAT, 256x128]
  %onnx::MatMul_17305[FLOAT, 128x384]
  %onnx::MatMul_17317[FLOAT, 128x128]
  %onnx::MatMul_17318[FLOAT, 128x512]
  %onnx::MatMul_17319[FLOAT, 256x128]
  %onnx::MatMul_17320[FLOAT, 128x384]
  %onnx::MatMul_17332[FLOAT, 128x128]
  %onnx::MatMul_17333[FLOAT, 128x512]
  %onnx::MatMul_17334[FLOAT, 256x128]
  %onnx::MatMul_17335[FLOAT, 128x384]
  %onnx::MatMul_17347[FLOAT, 128x128]
  %onnx::MatMul_17348[FLOAT, 128x512]
  %onnx::MatMul_17349[FLOAT, 256x128]
  %onnx::MatMul_17350[FLOAT, 128x128]
  %onnx::MatMul_17364[FLOAT, 128x128]
  %onnx::MatMul_17365[FLOAT, 128x512]
  %onnx::MatMul_17366[FLOAT, 256x128]
  %onnx::MatMul_17378[FLOAT, 128x128]
  %onnx::MatMul_17379[FLOAT, 128x512]
  %onnx::MatMul_17380[FLOAT, 256x128]
  %onnx::Expand_17382[FLOAT, 1x3x10]
  %onnx::Expand_17385[FLOAT, 1x3x10]
  %onnx::Expand_17388[FLOAT, 1x3x9]
  %onnx::Expand_17474[FLOAT, 1x3x10]
  %onnx::Expand_17477[FLOAT, 1x3x10]
  %onnx::Expand_17480[FLOAT, 1x3x9]
  %onnx::Expand_17566[FLOAT, 1x3x10]
  %onnx::Expand_17569[FLOAT, 1x3x10]
  %onnx::Expand_17572[FLOAT, 1x3x9]
  %onnx::Expand_17658[FLOAT, 1x3x10]
  %onnx::Expand_17661[FLOAT, 1x3x10]
  %onnx::Expand_17664[FLOAT, 1x3x9]
  %onnx::Expand_17750[FLOAT, 1x3x10]
  %onnx::Expand_17753[FLOAT, 1x3x10]
  %onnx::Expand_17756[FLOAT, 1x3x9]
  %onnx::Expand_17842[FLOAT, 1x3x10]
  %onnx::Expand_17845[FLOAT, 1x3x10]
  %onnx::Expand_17848[FLOAT, 1x3x9]
  %onnx::Expand_17934[FLOAT, 1x3x10]
  %onnx::Expand_17937[FLOAT, 1x3x10]
  %onnx::Expand_17940[FLOAT, 1x3x9]
  %onnx::Expand_18026[FLOAT, 1x3x10]
  %onnx::Expand_18029[FLOAT, 1x3x10]
  %onnx::Expand_18032[FLOAT, 1x3x9]
  %onnx::Expand_18118[FLOAT, 1x3x10]
  %onnx::Expand_18121[FLOAT, 1x3x10]
  %onnx::Expand_18124[FLOAT, 1x3x9]
  %onnx::Expand_18210[FLOAT, 1x3x10]
  %onnx::Expand_18213[FLOAT, 1x3x10]
  %onnx::Expand_18216[FLOAT, 1x3x9]
  %onnx::Mul_18302[FLOAT, 1x6]
) {
  %flow.flows.9.prqct.transform_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.9.prqct.identity_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.8.prqct.transform_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.8.prqct.identity_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.7.prqct.transform_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.7.prqct.identity_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.6.prqct.transform_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.6.prqct.identity_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.5.prqct.transform_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.5.prqct.identity_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.4.prqct.transform_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.4.prqct.identity_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.3.prqct.transform_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.3.prqct.identity_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.2.prqct.transform_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.flows.2.prqct.identity_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.1.prqct.transform_features = Identity(%flow.flows.0.prqct.identity_features)
  %flow.flows.1.prqct.identity_features = Identity(%flow.flows.0.prqct.transform_features)
  %flow.q0.log_scale = Identity(%flow.q0.loc)
  %/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Constant_1_output_0 = Constant[value = <Tensor>]()
  %/Unsqueeze_output_0 = Unsqueeze(%jets, %/Constant_1_output_0)
  %/Constant_2_output_0 = Constant[value = <Tensor>]()
  %/Unsqueeze_1_output_0 = Unsqueeze(%leptons, %/Constant_2_output_0)
  %/Constant_3_output_0 = Constant[value = <Tensor>]()
  %/Unsqueeze_2_output_0 = Unsqueeze(%met, %/Constant_3_output_0)
  %/Constant_4_output_0 = Constant[value = <Tensor>]()
  %/Unsqueeze_3_output_0 = Unsqueeze(%misc, %/Constant_4_output_0)
  %/jets_norm/Sub_output_0 = Sub(%/Unsqueeze_output_0, %jets_norm.means)
  %/jets_norm/Div_output_0 = Div(%/jets_norm/Sub_output_0, %onnx::Div_17258)
  %/jets_mlp/input_block/layers.0/MatMul_output_0 = MatMul(%/jets_norm/Div_output_0, %onnx::MatMul_17259)
  %/jets_mlp/input_block/layers.0/Add_output_0 = Add(%jets_mlp.input_block.layers.0.bias, %/jets_mlp/input_block/layers.0/MatMul_output_0)
  %/jets_mlp/input_block/layers.1/Sigmoid_output_0 = Sigmoid(%/jets_mlp/input_block/layers.0/Add_output_0)
  %/jets_mlp/input_block/layers.1/Mul_output_0 = Mul(%/jets_mlp/input_block/layers.0/Add_output_0, %/jets_mlp/input_block/layers.1/Sigmoid_output_0)
  %/jets_mlp/output_block/layers.0/MatMul_output_0 = MatMul(%/jets_mlp/input_block/layers.1/Mul_output_0, %onnx::MatMul_17260)
  %/jets_mlp/output_block/layers.0/Add_output_0 = Add(%jets_mlp.output_block.layers.0.bias, %/jets_mlp/output_block/layers.0/MatMul_output_0)
  %/leptons_norm/Sub_output_0 = Sub(%/Unsqueeze_1_output_0, %leptons_norm.means)
  %/leptons_norm/Div_output_0 = Div(%/leptons_norm/Sub_output_0, %onnx::Div_17262)
  %/leptons_mlp/input_block/layers.0/MatMul_output_0 = MatMul(%/leptons_norm/Div_output_0, %onnx::MatMul_17263)
  %/leptons_mlp/input_block/layers.0/Add_output_0 = Add(%leptons_mlp.input_block.layers.0.bias, %/leptons_mlp/input_block/layers.0/MatMul_output_0)
  %/leptons_mlp/input_block/layers.1/Sigmoid_output_0 = Sigmoid(%/leptons_mlp/input_block/layers.0/Add_output_0)
  %/leptons_mlp/input_block/layers.1/Mul_output_0 = Mul(%/leptons_mlp/input_block/layers.0/Add_output_0, %/leptons_mlp/input_block/layers.1/Sigmoid_output_0)
  %/leptons_mlp/output_block/layers.0/MatMul_output_0 = MatMul(%/leptons_mlp/input_block/layers.1/Mul_output_0, %onnx::MatMul_17264)
  %/leptons_mlp/output_block/layers.0/Add_output_0 = Add(%leptons_mlp.output_block.layers.0.bias, %/leptons_mlp/output_block/layers.0/MatMul_output_0)
  %/met_norm/Sub_output_0 = Sub(%/Unsqueeze_2_output_0, %met_norm.means)
  %/met_norm/Div_output_0 = Div(%/met_norm/Sub_output_0, %onnx::Div_17266)
  %/met_mlp/input_block/layers.0/MatMul_output_0 = MatMul(%/met_norm/Div_output_0, %onnx::MatMul_17267)
  %/met_mlp/input_block/layers.0/Add_output_0 = Add(%met_mlp.input_block.layers.0.bias, %/met_mlp/input_block/layers.0/MatMul_output_0)
  %/met_mlp/input_block/layers.1/Sigmoid_output_0 = Sigmoid(%/met_mlp/input_block/layers.0/Add_output_0)
  %/met_mlp/input_block/layers.1/Mul_output_0 = Mul(%/met_mlp/input_block/layers.0/Add_output_0, %/met_mlp/input_block/layers.1/Sigmoid_output_0)
  %/met_mlp/output_block/layers.0/MatMul_output_0 = MatMul(%/met_mlp/input_block/layers.1/Mul_output_0, %onnx::MatMul_17268)
  %/met_mlp/output_block/layers.0/Add_output_0 = Add(%met_mlp.output_block.layers.0.bias, %/met_mlp/output_block/layers.0/MatMul_output_0)
  %/misc_norm/Sub_output_0 = Sub(%/Unsqueeze_3_output_0, %misc_norm.means)
  %/misc_norm/Div_output_0 = Div(%/misc_norm/Sub_output_0, %onnx::Div_17270)
  %/misc_mlp/input_block/layers.0/MatMul_output_0 = MatMul(%/misc_norm/Div_output_0, %onnx::MatMul_17271)
  %/misc_mlp/input_block/layers.0/Add_output_0 = Add(%misc_mlp.input_block.layers.0.bias, %/misc_mlp/input_block/layers.0/MatMul_output_0)
  %/misc_mlp/input_block/layers.1/Sigmoid_output_0 = Sigmoid(%/misc_mlp/input_block/layers.0/Add_output_0)
  %/misc_mlp/input_block/layers.1/Mul_output_0 = Mul(%/misc_mlp/input_block/layers.0/Add_output_0, %/misc_mlp/input_block/layers.1/Sigmoid_output_0)
  %/misc_mlp/output_block/layers.0/MatMul_output_0 = MatMul(%/misc_mlp/input_block/layers.1/Mul_output_0, %onnx::MatMul_17272)
  %/misc_mlp/output_block/layers.0/Add_output_0 = Add(%misc_mlp.output_block.layers.0.bias, %/misc_mlp/output_block/layers.0/MatMul_output_0)
  %/SequenceConstruct_output_0 = SequenceConstruct(%/jets_mlp/output_block/layers.0/Add_output_0, %/leptons_mlp/output_block/layers.0/Add_output_0, %/met_mlp/output_block/layers.0/Add_output_0, %/misc_mlp/output_block/layers.0/Add_output_0)
  %/Constant_5_output_0 = Constant[value = <Scalar Tensor []>]()
  %/SequenceAt_output_0 = SequenceAt(%/SequenceConstruct_output_0, %/Constant_5_output_0)
  %/Shape_output_0 = Shape(%/SequenceAt_output_0)
  %/Size_output_0 = Size(%/Shape_output_0)
  %/Constant_6_output_0 = Constant[value = <Scalar Tensor []>]()
  %/Equal_output_0 = Equal(%/Size_output_0, %/Constant_6_output_0)
  %/If_output_0 = If[else_branch = <graph sub_graph1>, then_branch = <graph sub_graph>](%/Equal_output_0)
  %/transformer/encoder/linear_embed/MatMul_output_0 = MatMul(%/If_output_0, %onnx::MatMul_17273)
  %/transformer/encoder/linear_embed/Add_output_0 = Add(%transformer.encoder.linear_embed.bias, %/transformer/encoder/linear_embed/MatMul_output_0)
  %/transformer/encoder/Shape_output_0 = Shape(%/transformer/encoder/linear_embed/Add_output_0)
  %/transformer/encoder/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/Gather_output_0 = Gather[axis = 0](%/transformer/encoder/Shape_output_0, %/transformer/encoder/Constant_output_0)
  %/transformer/encoder/Shape_1_output_0 = Shape(%/transformer/encoder/linear_embed/Add_output_0)
  %/transformer/encoder/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/Gather_1_output_0 = Gather[axis = 0](%/transformer/encoder/Shape_1_output_0, %/transformer/encoder/Constant_1_output_0)
  %/transformer/encoder/Constant_2_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/Constant_3_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/Unsqueeze_output_0 = Unsqueeze(%/transformer/encoder/Gather_output_0, %/transformer/encoder/Constant_3_output_0)
  %/transformer/encoder/Constant_4_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/Constant_5_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/Unsqueeze_1_output_0 = Unsqueeze(%/transformer/encoder/Gather_1_output_0, %/transformer/encoder/Constant_5_output_0)
  %/transformer/encoder/Concat_output_0 = Concat[axis = 0](%/transformer/encoder/Unsqueeze_output_0, %/transformer/encoder/Constant_4_output_0, %/transformer/encoder/Unsqueeze_1_output_0)
  %/transformer/encoder/Constant_6_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/Reshape_output_0 = Reshape[allowzero = 0](%/transformer/encoder/Concat_output_0, %/transformer/encoder/Constant_6_output_0)
  %/transformer/encoder/Shape_2_output_0 = Shape(%/transformer/encoder/Reshape_output_0)
  %/transformer/encoder/ConstantOfShape_output_0 = ConstantOfShape[value = <Tensor>](%/transformer/encoder/Shape_2_output_0)
  %/transformer/encoder/Constant_7_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/Mul_output_0 = Mul(%/transformer/encoder/ConstantOfShape_output_0, %/transformer/encoder/Constant_7_output_0)
  %/transformer/encoder/Equal_output_0 = Equal(%/transformer/encoder/Reshape_output_0, %/transformer/encoder/Mul_output_0)
  %/transformer/encoder/Where_output_0 = Where(%/transformer/encoder/Equal_output_0, %/transformer/encoder/ConstantOfShape_output_0, %/transformer/encoder/Reshape_output_0)
  %/transformer/encoder/Expand_output_0 = Expand(%transformer.encoder.registers, %/transformer/encoder/Where_output_0)
  %/transformer/encoder/Concat_1_output_0 = Concat[axis = -2](%/transformer/encoder/Expand_output_0, %/transformer/encoder/linear_embed/Add_output_0)
  %/transformer/encoder/layers.0/attn/norm/ReduceMean_output_0 = ReduceMean[axes = [-1]](%/transformer/encoder/Concat_1_output_0)
  %/transformer/encoder/layers.0/attn/norm/Sub_output_0 = Sub(%/transformer/encoder/Concat_1_output_0, %/transformer/encoder/layers.0/attn/norm/ReduceMean_output_0)
  %/transformer/encoder/layers.0/attn/norm/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.0/attn/norm/Pow_output_0 = Pow(%/transformer/encoder/layers.0/attn/norm/Sub_output_0, %/transformer/encoder/layers.0/attn/norm/Constant_output_0)
  %/transformer/encoder/layers.0/attn/norm/ReduceMean_1_output_0 = ReduceMean[axes = [-1]](%/transformer/encoder/layers.0/attn/norm/Pow_output_0)
  %/transformer/encoder/layers.0/attn/norm/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.0/attn/norm/Add_output_0 = Add(%/transformer/encoder/layers.0/attn/norm/ReduceMean_1_output_0, %/transformer/encoder/layers.0/attn/norm/Constant_1_output_0)
  %/transformer/encoder/layers.0/attn/norm/Sqrt_output_0 = Sqrt(%/transformer/encoder/layers.0/attn/norm/Add_output_0)
  %/transformer/encoder/layers.0/attn/norm/Div_output_0 = Div(%/transformer/encoder/layers.0/attn/norm/Sub_output_0, %/transformer/encoder/layers.0/attn/norm/Sqrt_output_0)
  %/transformer/encoder/layers.0/attn/norm/Mul_output_0 = Mul(%/transformer/encoder/layers.0/attn/norm/Div_output_0, %transformer.encoder.layers.0.attn.norm.weight)
  %/transformer/encoder/layers.0/attn/norm/Add_1_output_0 = Add(%/transformer/encoder/layers.0/attn/norm/Mul_output_0, %transformer.encoder.layers.0.attn.norm.bias)
  %/transformer/encoder/layers.0/attn/fn/Shape_output_0 = Shape(%/transformer/encoder/layers.0/attn/norm/Add_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.0/attn/fn/Gather_output_0 = Gather[axis = 0](%/transformer/encoder/layers.0/attn/fn/Shape_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_output_0)
  %/transformer/encoder/layers.0/attn/fn/MatMul_output_0 = MatMul(%/transformer/encoder/layers.0/attn/norm/Add_1_output_0, %onnx::MatMul_17275)
  %/transformer/encoder/layers.0/attn/fn/Add_output_0 = Add(%transformer.encoder.layers.0.attn.fn.attn_in_b, %/transformer/encoder/layers.0/attn/fn/MatMul_output_0)
  %/transformer/encoder/layers.0/attn/fn/Shape_1_output_0 = Shape(%/transformer/encoder/layers.0/attn/fn/Add_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_1_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Gather_1_output_0 = Gather[axis = 0](%/transformer/encoder/layers.0/attn/fn/Shape_1_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_2_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_3_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Add_1_output_0 = Add(%/transformer/encoder/layers.0/attn/fn/Gather_1_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_3_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_4_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Div_output_0 = Div(%/transformer/encoder/layers.0/attn/fn/Add_1_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_4_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_5_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Mul_output_0 = Mul(%/transformer/encoder/layers.0/attn/fn/Div_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_5_output_0)
  %/transformer/encoder/layers.0/attn/fn/Slice_output_0 = Slice(%/transformer/encoder/layers.0/attn/fn/Add_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_2_output_0, %/transformer/encoder/layers.0/attn/fn/Mul_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_6_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Mul_1_output_0 = Mul(%/transformer/encoder/layers.0/attn/fn/Div_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_6_output_0)
  %/transformer/encoder/layers.0/attn/fn/Slice_1_output_0 = Slice(%/transformer/encoder/layers.0/attn/fn/Add_output_0, %/transformer/encoder/layers.0/attn/fn/Mul_output_0, %/transformer/encoder/layers.0/attn/fn/Mul_1_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_7_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Mul_2_output_0 = Mul(%/transformer/encoder/layers.0/attn/fn/Div_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_7_output_0)
  %/transformer/encoder/layers.0/attn/fn/Slice_2_output_0 = Slice(%/transformer/encoder/layers.0/attn/fn/Add_output_0, %/transformer/encoder/layers.0/attn/fn/Mul_1_output_0, %/transformer/encoder/layers.0/attn/fn/Mul_2_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_1_output_0)
  %onnx::Unsqueeze_390 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Unsqueeze_output_0 = Unsqueeze(%/transformer/encoder/layers.0/attn/fn/Gather_output_0, %onnx::Unsqueeze_390)
  %/transformer/encoder/layers.0/attn/fn/Constant_8_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_9_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_10_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Concat_output_0 = Concat[axis = 0](%/transformer/encoder/layers.0/attn/fn/Unsqueeze_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_8_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_9_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_10_output_0)
  %onnx::Unsqueeze_399 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Unsqueeze_1_output_0 = Unsqueeze(%/transformer/encoder/layers.0/attn/fn/Gather_output_0, %onnx::Unsqueeze_399)
  %/transformer/encoder/layers.0/attn/fn/Constant_11_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_12_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_13_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Concat_1_output_0 = Concat[axis = 0](%/transformer/encoder/layers.0/attn/fn/Unsqueeze_1_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_11_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_12_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_13_output_0)
  %onnx::Unsqueeze_408 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Unsqueeze_2_output_0 = Unsqueeze(%/transformer/encoder/layers.0/attn/fn/Gather_output_0, %onnx::Unsqueeze_408)
  %/transformer/encoder/layers.0/attn/fn/Constant_14_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_15_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_16_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Concat_2_output_0 = Concat[axis = 0](%/transformer/encoder/layers.0/attn/fn/Unsqueeze_2_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_14_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_15_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_16_output_0)
  %/transformer/encoder/layers.0/attn/fn/Reshape_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.0/attn/fn/Slice_output_0, %/transformer/encoder/layers.0/attn/fn/Concat_output_0)
  %/transformer/encoder/layers.0/attn/fn/Transpose_output_0 = Transpose[perm = [0, 2, 1, 3]](%/transformer/encoder/layers.0/attn/fn/Reshape_output_0)
  %/transformer/encoder/layers.0/attn/fn/Reshape_1_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.0/attn/fn/Slice_1_output_0, %/transformer/encoder/layers.0/attn/fn/Concat_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Reshape_2_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.0/attn/fn/Slice_2_output_0, %/transformer/encoder/layers.0/attn/fn/Concat_2_output_0)
  %/transformer/encoder/layers.0/attn/fn/Transpose_1_output_0 = Transpose[perm = [0, 2, 1, 3]](%/transformer/encoder/layers.0/attn/fn/Reshape_2_output_0)
  %/transformer/encoder/layers.0/attn/fn/Shape_2_output_0 = Shape(%/transformer/encoder/layers.0/attn/fn/Transpose_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_17_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_18_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Slice_3_output_0 = Slice(%/transformer/encoder/layers.0/attn/fn/Shape_2_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_17_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_18_output_0)
  %/transformer/encoder/layers.0/attn/fn/Cast_output_0 = Cast[to = 1](%/transformer/encoder/layers.0/attn/fn/Slice_3_output_0)
  %/transformer/encoder/layers.0/attn/fn/Sqrt_output_0 = Sqrt(%/transformer/encoder/layers.0/attn/fn/Cast_output_0)
  %/transformer/encoder/layers.0/attn/fn/Constant_19_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Div_1_output_0 = Div(%/transformer/encoder/layers.0/attn/fn/Constant_19_output_0, %/transformer/encoder/layers.0/attn/fn/Sqrt_output_0)
  %/transformer/encoder/layers.0/attn/fn/Cast_1_output_0 = Cast[to = 1](%/transformer/encoder/layers.0/attn/fn/Div_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Transpose_2_output_0 = Transpose[perm = [0, 2, 3, 1]](%/transformer/encoder/layers.0/attn/fn/Reshape_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Sqrt_1_output_0 = Sqrt(%/transformer/encoder/layers.0/attn/fn/Cast_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Mul_3_output_0 = Mul(%/transformer/encoder/layers.0/attn/fn/Transpose_output_0, %/transformer/encoder/layers.0/attn/fn/Sqrt_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Sqrt_2_output_0 = Sqrt(%/transformer/encoder/layers.0/attn/fn/Cast_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Mul_4_output_0 = Mul(%/transformer/encoder/layers.0/attn/fn/Transpose_2_output_0, %/transformer/encoder/layers.0/attn/fn/Sqrt_2_output_0)
  %/transformer/encoder/layers.0/attn/fn/MatMul_1_output_0 = MatMul(%/transformer/encoder/layers.0/attn/fn/Mul_3_output_0, %/transformer/encoder/layers.0/attn/fn/Mul_4_output_0)
  %/transformer/encoder/layers.0/attn/fn/Softmax_output_0 = Softmax[axis = -1](%/transformer/encoder/layers.0/attn/fn/MatMul_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/MatMul_2_output_0 = MatMul(%/transformer/encoder/layers.0/attn/fn/Softmax_output_0, %/transformer/encoder/layers.0/attn/fn/Transpose_1_output_0)
  %/transformer/encoder/layers.0/attn/fn/Transpose_3_output_0 = Transpose[perm = [0, 2, 1, 3]](%/transformer/encoder/layers.0/attn/fn/MatMul_2_output_0)
  %onnx::Unsqueeze_442 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Unsqueeze_3_output_0 = Unsqueeze(%/transformer/encoder/layers.0/attn/fn/Gather_output_0, %onnx::Unsqueeze_442)
  %/transformer/encoder/layers.0/attn/fn/Constant_20_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Constant_21_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/attn/fn/Concat_3_output_0 = Concat[axis = 0](%/transformer/encoder/layers.0/attn/fn/Unsqueeze_3_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_20_output_0, %/transformer/encoder/layers.0/attn/fn/Constant_21_output_0)
  %/transformer/encoder/layers.0/attn/fn/Reshape_3_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.0/attn/fn/Transpose_3_output_0, %/transformer/encoder/layers.0/attn/fn/Concat_3_output_0)
  %/transformer/encoder/layers.0/attn/fn/attn_out/MatMul_output_0 = MatMul(%/transformer/encoder/layers.0/attn/fn/Reshape_3_output_0, %onnx::MatMul_17287)
  %/transformer/encoder/layers.0/attn/fn/attn_out/Add_output_0 = Add(%transformer.encoder.layers.0.attn.fn.attn_out.bias, %/transformer/encoder/layers.0/attn/fn/attn_out/MatMul_output_0)
  %/transformer/encoder/layers.0/attn/ls/Mul_output_0 = Mul(%/transformer/encoder/layers.0/attn/fn/attn_out/Add_output_0, %transformer.encoder.layers.0.attn.ls.gamma)
  %/transformer/encoder/layers.0/attn/Add_output_0 = Add(%/transformer/encoder/layers.0/attn/ls/Mul_output_0, %/transformer/encoder/Concat_1_output_0)
  %/transformer/encoder/layers.0/ff/norm/ReduceMean_output_0 = ReduceMean[axes = [-1]](%/transformer/encoder/layers.0/attn/Add_output_0)
  %/transformer/encoder/layers.0/ff/norm/Sub_output_0 = Sub(%/transformer/encoder/layers.0/attn/Add_output_0, %/transformer/encoder/layers.0/ff/norm/ReduceMean_output_0)
  %/transformer/encoder/layers.0/ff/norm/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.0/ff/norm/Pow_output_0 = Pow(%/transformer/encoder/layers.0/ff/norm/Sub_output_0, %/transformer/encoder/layers.0/ff/norm/Constant_output_0)
  %/transformer/encoder/layers.0/ff/norm/ReduceMean_1_output_0 = ReduceMean[axes = [-1]](%/transformer/encoder/layers.0/ff/norm/Pow_output_0)
  %/transformer/encoder/layers.0/ff/norm/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.0/ff/norm/Add_output_0 = Add(%/transformer/encoder/layers.0/ff/norm/ReduceMean_1_output_0, %/transformer/encoder/layers.0/ff/norm/Constant_1_output_0)
  %/transformer/encoder/layers.0/ff/norm/Sqrt_output_0 = Sqrt(%/transformer/encoder/layers.0/ff/norm/Add_output_0)
  %/transformer/encoder/layers.0/ff/norm/Div_output_0 = Div(%/transformer/encoder/layers.0/ff/norm/Sub_output_0, %/transformer/encoder/layers.0/ff/norm/Sqrt_output_0)
  %/transformer/encoder/layers.0/ff/norm/Mul_output_0 = Mul(%/transformer/encoder/layers.0/ff/norm/Div_output_0, %transformer.encoder.layers.0.ff.norm.weight)
  %/transformer/encoder/layers.0/ff/norm/Add_1_output_0 = Add(%/transformer/encoder/layers.0/ff/norm/Mul_output_0, %transformer.encoder.layers.0.ff.norm.bias)
  %/transformer/encoder/layers.0/ff/fn/lin1/MatMul_output_0 = MatMul(%/transformer/encoder/layers.0/ff/norm/Add_1_output_0, %onnx::MatMul_17288)
  %/transformer/encoder/layers.0/ff/fn/lin1/Add_output_0 = Add(%transformer.encoder.layers.0.ff.fn.lin1.bias, %/transformer/encoder/layers.0/ff/fn/lin1/MatMul_output_0)
  %/transformer/encoder/layers.0/ff/fn/Shape_output_0 = Shape(%/transformer/encoder/layers.0/ff/fn/lin1/Add_output_0)
  %/transformer/encoder/layers.0/ff/fn/Constant_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/ff/fn/Gather_output_0 = Gather[axis = 0](%/transformer/encoder/layers.0/ff/fn/Shape_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_output_0)
  %/transformer/encoder/layers.0/ff/fn/Constant_1_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/ff/fn/Constant_2_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/ff/fn/Add_output_0 = Add(%/transformer/encoder/layers.0/ff/fn/Gather_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_2_output_0)
  %/transformer/encoder/layers.0/ff/fn/Constant_3_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/ff/fn/Div_output_0 = Div(%/transformer/encoder/layers.0/ff/fn/Add_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_3_output_0)
  %/transformer/encoder/layers.0/ff/fn/Constant_4_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/ff/fn/Mul_output_0 = Mul(%/transformer/encoder/layers.0/ff/fn/Div_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_4_output_0)
  %/transformer/encoder/layers.0/ff/fn/Slice_output_0 = Slice(%/transformer/encoder/layers.0/ff/fn/lin1/Add_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_1_output_0, %/transformer/encoder/layers.0/ff/fn/Mul_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_output_0)
  %/transformer/encoder/layers.0/ff/fn/Constant_5_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.0/ff/fn/Mul_1_output_0 = Mul(%/transformer/encoder/layers.0/ff/fn/Div_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_5_output_0)
  %/transformer/encoder/layers.0/ff/fn/Slice_1_output_0 = Slice(%/transformer/encoder/layers.0/ff/fn/lin1/Add_output_0, %/transformer/encoder/layers.0/ff/fn/Mul_output_0, %/transformer/encoder/layers.0/ff/fn/Mul_1_output_0, %/transformer/encoder/layers.0/ff/fn/Constant_output_0)
  %/transformer/encoder/layers.0/ff/fn/Sigmoid_output_0 = Sigmoid(%/transformer/encoder/layers.0/ff/fn/Slice_output_0)
  %/transformer/encoder/layers.0/ff/fn/Mul_2_output_0 = Mul(%/transformer/encoder/layers.0/ff/fn/Slice_output_0, %/transformer/encoder/layers.0/ff/fn/Sigmoid_output_0)
  %/transformer/encoder/layers.0/ff/fn/Mul_3_output_0 = Mul(%/transformer/encoder/layers.0/ff/fn/Mul_2_output_0, %/transformer/encoder/layers.0/ff/fn/Slice_1_output_0)
  %/transformer/encoder/layers.0/ff/fn/lin2/MatMul_output_0 = MatMul(%/transformer/encoder/layers.0/ff/fn/Mul_3_output_0, %onnx::MatMul_17289)
  %/transformer/encoder/layers.0/ff/fn/lin2/Add_output_0 = Add(%transformer.encoder.layers.0.ff.fn.lin2.bias, %/transformer/encoder/layers.0/ff/fn/lin2/MatMul_output_0)
  %/transformer/encoder/layers.0/ff/ls/Mul_output_0 = Mul(%/transformer/encoder/layers.0/ff/fn/lin2/Add_output_0, %transformer.encoder.layers.0.ff.ls.gamma)
  %/transformer/encoder/layers.0/ff/Add_output_0 = Add(%/transformer/encoder/layers.0/ff/ls/Mul_output_0, %/transformer/encoder/layers.0/attn/Add_output_0)
  %/transformer/encoder/layers.1/attn/norm/ReduceMean_output_0 = ReduceMean[axes = [-1]](%/transformer/encoder/layers.0/ff/Add_output_0)
  %/transformer/encoder/layers.1/attn/norm/Sub_output_0 = Sub(%/transformer/encoder/layers.0/ff/Add_output_0, %/transformer/encoder/layers.1/attn/norm/ReduceMean_output_0)
  %/transformer/encoder/layers.1/attn/norm/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.1/attn/norm/Pow_output_0 = Pow(%/transformer/encoder/layers.1/attn/norm/Sub_output_0, %/transformer/encoder/layers.1/attn/norm/Constant_output_0)
  %/transformer/encoder/layers.1/attn/norm/ReduceMean_1_output_0 = ReduceMean[axes = [-1]](%/transformer/encoder/layers.1/attn/norm/Pow_output_0)
  %/transformer/encoder/layers.1/attn/norm/Constant_1_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.1/attn/norm/Add_output_0 = Add(%/transformer/encoder/layers.1/attn/norm/ReduceMean_1_output_0, %/transformer/encoder/layers.1/attn/norm/Constant_1_output_0)
  %/transformer/encoder/layers.1/attn/norm/Sqrt_output_0 = Sqrt(%/transformer/encoder/layers.1/attn/norm/Add_output_0)
  %/transformer/encoder/layers.1/attn/norm/Div_output_0 = Div(%/transformer/encoder/layers.1/attn/norm/Sub_output_0, %/transformer/encoder/layers.1/attn/norm/Sqrt_output_0)
  %/transformer/encoder/layers.1/attn/norm/Mul_output_0 = Mul(%/transformer/encoder/layers.1/attn/norm/Div_output_0, %transformer.encoder.layers.1.attn.norm.weight)
  %/transformer/encoder/layers.1/attn/norm/Add_1_output_0 = Add(%/transformer/encoder/layers.1/attn/norm/Mul_output_0, %transformer.encoder.layers.1.attn.norm.bias)
  %/transformer/encoder/layers.1/attn/fn/Shape_output_0 = Shape(%/transformer/encoder/layers.1/attn/norm/Add_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_output_0 = Constant[value = <Scalar Tensor []>]()
  %/transformer/encoder/layers.1/attn/fn/Gather_output_0 = Gather[axis = 0](%/transformer/encoder/layers.1/attn/fn/Shape_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_output_0)
  %/transformer/encoder/layers.1/attn/fn/MatMul_output_0 = MatMul(%/transformer/encoder/layers.1/attn/norm/Add_1_output_0, %onnx::MatMul_17290)
  %/transformer/encoder/layers.1/attn/fn/Add_output_0 = Add(%transformer.encoder.layers.1.attn.fn.attn_in_b, %/transformer/encoder/layers.1/attn/fn/MatMul_output_0)
  %/transformer/encoder/layers.1/attn/fn/Shape_1_output_0 = Shape(%/transformer/encoder/layers.1/attn/fn/Add_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_1_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Gather_1_output_0 = Gather[axis = 0](%/transformer/encoder/layers.1/attn/fn/Shape_1_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_2_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_3_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Add_1_output_0 = Add(%/transformer/encoder/layers.1/attn/fn/Gather_1_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_3_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_4_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Div_output_0 = Div(%/transformer/encoder/layers.1/attn/fn/Add_1_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_4_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_5_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Mul_output_0 = Mul(%/transformer/encoder/layers.1/attn/fn/Div_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_5_output_0)
  %/transformer/encoder/layers.1/attn/fn/Slice_output_0 = Slice(%/transformer/encoder/layers.1/attn/fn/Add_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_2_output_0, %/transformer/encoder/layers.1/attn/fn/Mul_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_6_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Mul_1_output_0 = Mul(%/transformer/encoder/layers.1/attn/fn/Div_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_6_output_0)
  %/transformer/encoder/layers.1/attn/fn/Slice_1_output_0 = Slice(%/transformer/encoder/layers.1/attn/fn/Add_output_0, %/transformer/encoder/layers.1/attn/fn/Mul_output_0, %/transformer/encoder/layers.1/attn/fn/Mul_1_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_7_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Mul_2_output_0 = Mul(%/transformer/encoder/layers.1/attn/fn/Div_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_7_output_0)
  %/transformer/encoder/layers.1/attn/fn/Slice_2_output_0 = Slice(%/transformer/encoder/layers.1/attn/fn/Add_output_0, %/transformer/encoder/layers.1/attn/fn/Mul_1_output_0, %/transformer/encoder/layers.1/attn/fn/Mul_2_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_1_output_0)
  %onnx::Unsqueeze_525 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Unsqueeze_output_0 = Unsqueeze(%/transformer/encoder/layers.1/attn/fn/Gather_output_0, %onnx::Unsqueeze_525)
  %/transformer/encoder/layers.1/attn/fn/Constant_8_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_9_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_10_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Concat_output_0 = Concat[axis = 0](%/transformer/encoder/layers.1/attn/fn/Unsqueeze_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_8_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_9_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_10_output_0)
  %onnx::Unsqueeze_534 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Unsqueeze_1_output_0 = Unsqueeze(%/transformer/encoder/layers.1/attn/fn/Gather_output_0, %onnx::Unsqueeze_534)
  %/transformer/encoder/layers.1/attn/fn/Constant_11_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_12_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_13_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Concat_1_output_0 = Concat[axis = 0](%/transformer/encoder/layers.1/attn/fn/Unsqueeze_1_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_11_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_12_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_13_output_0)
  %onnx::Unsqueeze_543 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Unsqueeze_2_output_0 = Unsqueeze(%/transformer/encoder/layers.1/attn/fn/Gather_output_0, %onnx::Unsqueeze_543)
  %/transformer/encoder/layers.1/attn/fn/Constant_14_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_15_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_16_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Concat_2_output_0 = Concat[axis = 0](%/transformer/encoder/layers.1/attn/fn/Unsqueeze_2_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_14_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_15_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_16_output_0)
  %/transformer/encoder/layers.1/attn/fn/Reshape_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.1/attn/fn/Slice_output_0, %/transformer/encoder/layers.1/attn/fn/Concat_output_0)
  %/transformer/encoder/layers.1/attn/fn/Transpose_output_0 = Transpose[perm = [0, 2, 1, 3]](%/transformer/encoder/layers.1/attn/fn/Reshape_output_0)
  %/transformer/encoder/layers.1/attn/fn/Reshape_1_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.1/attn/fn/Slice_1_output_0, %/transformer/encoder/layers.1/attn/fn/Concat_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Reshape_2_output_0 = Reshape[allowzero = 0](%/transformer/encoder/layers.1/attn/fn/Slice_2_output_0, %/transformer/encoder/layers.1/attn/fn/Concat_2_output_0)
  %/transformer/encoder/layers.1/attn/fn/Transpose_1_output_0 = Transpose[perm = [0, 2, 1, 3]](%/transformer/encoder/layers.1/attn/fn/Reshape_2_output_0)
  %/transformer/encoder/layers.1/attn/fn/Shape_2_output_0 = Shape(%/transformer/encoder/layers.1/attn/fn/Transpose_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_17_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Constant_18_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Slice_3_output_0 = Slice(%/transformer/encoder/layers.1/attn/fn/Shape_2_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_17_output_0, %/transformer/encoder/layers.1/attn/fn/Constant_18_output_0)
  %/transformer/encoder/layers.1/attn/fn/Cast_output_0 = Cast[to = 1](%/transformer/encoder/layers.1/attn/fn/Slice_3_output_0)
  %/transformer/encoder/layers.1/attn/fn/Sqrt_output_0 = Sqrt(%/transformer/encoder/layers.1/attn/fn/Cast_output_0)
  %/transformer/encoder/layers.1/attn/fn/Constant_19_output_0 = Constant[value = <Tensor>]()
  %/transformer/encoder/layers.1/attn/fn/Div_1_output_0 = Div(%/transformer/encoder/layers.1/attn/fn/Constant_19_output_0, %/transformer/encoder/layers.1/attn/fn/Sqrt_output_0)
  %/transformer/encoder/layers.1/attn/fn/Cast_1_output_0 = Cast[to = 1](%/transformer/encoder/layers.1/attn/fn/Div_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Transpose_2_output_0 = Transpose[perm = [0, 2, 3, 1]](%/transformer/encoder/layers.1/attn/fn/Reshape_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Sqrt_1_output_0 = Sqrt(%/transformer/encoder/layers.1/attn/fn/Cast_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Mul_3_output_0 = Mul(%/transformer/encoder/layers.1/attn/fn/Transpose_output_0, %/transformer/encoder/layers.1/attn/fn/Sqrt_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Sqrt_2_output_0 = Sqrt(%/transformer/encoder/layers.1/attn/fn/Cast_1_output_0)
  %/transformer/encoder/layers.1/attn/fn/Mul_4_output_0 = Mul(%/transformer/encoder/layers.1/attn/fn/Transpose_2_output_0, %/transformer/encoder/layers.1/attn/fn/Sqrt_2_output_0)
  %/transformer/encoder/layers.1/attn/fn/MatMul_1_output_0 = MatMul(%/transformer/encoder/layers.1/attn/fn/Mul_3_output_0, %/transformer/encoder/layers.1/attn/fn/Mul_4_output_0)
  %/transformer/encoder/layers.1/attn/fn/Softmax_output_0 = Softmax[axis = -1](%/transformer/encoder/layers.1/attn/fn/MatMul_1_output_0)
